Data/Final_Implemented_data/Request/Implemented 400/Text Files/test_rand1.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   12.794 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      41036000 bytes
HTML transferred:       40960000 bytes
Requests per second:    31.26 [#/sec] (mean)
Time per request:       319.861 [ms] (mean)
Time per request:       31.986 [ms] (mean, across all concurrent requests)
Transfer rate:          3132.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       10  255  78.7    252     493
Processing:     1   59  58.3     54     529
Waiting:        0   58  58.1     53     529
Total:         18  314  92.3    305     659

Percentage of the requests served within a certain time (ms)
  50%    305
  66%    349
  75%    381
  80%    391
  90%    443
  95%    465
  98%    500
  99%    530
 100%    659 (longest request)